namespace SDX
{
namespace Texts
{
    struct NameInfo
    {
        const char* name;
        const char* info;
    };

    const NameInfo 勲章[15] =
    {
        {"？？？","20回仕事を完了する"},
        {"？？？","100回仕事を完了する"},
        {"？？？","500回仕事を完了する"},
        {"？？？","20回装備を強化する"},
        {"？？？","100回装備を強化する"},
        {"？？？","500回装備を強化する"},
        {"？？？","100コンボ達成"},
        {"？？？","200コンボ達成"},
        {"？？？","300コンボ達成"},
        {"？？？","ハイスコア合計が100万"},
        {"？？？","ハイスコア合計が1000万"},
        {"？？？","ハイスコア合計が1億"},
        {"？？？","全ての装備をLV100以上にする"},
        {"？？？","全ての仕事を完了する"},
        {"？？？","神を倒す"}
    };

    const NameInfo 装備[15] =
    {
        {"れいむ"  ,"れいむのボディ\n耐久が上がるぞ"},
        {"すいか"  ,"れいむのメイン武器\n攻撃力があがるぞ"},
        {"てんこ"  ,"れいむのサイド武器\n攻撃力があがるぞ"},
        {"まりさ"  ,"まりさのボディ\n耐久が上がるぞ"},
        {"ありす"  ,"まりさのメイン武器\n攻撃力が上がるぞ"},
        {"ぱちぇ"  ,"まりさのサイド武器\n攻撃力が上がるぞ"},
        {"れみりゃ","れみりゃのボディ\n耐久が上がるぞ"},
        {"ふらん"  ,"れみりゃのサイド武器\n攻撃力が上がるぞ"},
        {"さくや"  ,"れみりゃのサイド武器\n攻撃力が上がるぞ"},
        {"てい"    ,"共通パーツ\nレアアイテムのドロップ率が上がるぞ"},
        {"ちるの"  ,"共通パーツ\n敵の攻撃が当たりにくくなるぞ"},
        {"ゆうぎ"  ,"共通パーツ\n全ての武器が少し強くなるぞ"},
        {"ゆーびぃ","共通パーツ\nアイテムの回収範囲が広がるぞ"},
        {"テルヨフ","共通パーツ\n耐久ゲージの回復速度が上がるぞ"},
        {"いくさん","共通パーツ\n全てのボディが少し固くなるぞ"}
    };

    const NameInfo 素材[36] =
    {
        {"銅まん"  ,"ボディに使われる素材\n"},
        {"銀まん"  ,"ボディに使われる素材\n"},
        {"金まん"  ,"ボディに使われる素材\n"},
        {"闇まん"  ,"ボディに使われる素材\n"},
        {"装甲板"  ,"ボディに使われる素材\n"},
        {"超装甲板","ボディに使われる素材\n"},
        {"赤の餡"  ,"動力に使われる素材\n"},
        {"青の餡"  ,"動力に使われる素材\n"},
        {"金の餡"  ,"動力に使われる素材\n"},
        {"闇の餡"  ,"動力に使われる素材\n"},	
        {"ないぞう","動力に使われる素材\n"},
        {"はらわた","動力に使われる素材\n"},
        {"銅貨"    ,"弾丸に使われる素材\n"},
        {"銀貨"    ,"弾丸に使われる素材\n"},
        {"金貨"    ,"弾丸に使われる素材\n"},
        {"札束"    ,"弾丸に使われる素材\n"},
        {"羽の欠片","弾丸に使われる素材\n"},
        {"羽の部品","弾丸に使われる素材\n"},
        {"赤の球"  ,""},
        {"青の球"  ,""},
        {"金の球"  ,""},
        {"闇の球"  ,""},
        {"天使の翼",""},
        {"天使の輪",""},
        {"赤魔石"  ,""},
        {"青魔石"  ,""},
        {"金魔石"  ,""},
        {"闇魔石"  ,""},
        {"金剛石"  ,""},
        {"大金剛石",""},		
        {"鉄の塊"  ,"色々使える素材"},
        {"銀の塊"  ,"色々使える素材"},
        {"金の塊"  ,"色々使える素材"},
        {"闇の塊"  ,"色々使える素材"},
        {"虹の塊"  ,"色々使える素材"},
        {"ディスク","謎の素材"},    
    };
}
}